Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་སྣའི་རྣམ་པར་ཤེས་པ་དང་ལྕེའི་རྣམ་པར་ཤེས་པ་དང་ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་སྣའི་རྣམ་པར་ཤེས་པ་དང་ལྕེའི་རྣམ་པར་ཤེས་པ་དང་ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་། མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are impermanent, and they teach that auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, and mental consciousness are imbued with suffering, without self, and unpleasant. “

source: མིག་གི་འདུས་ཏེ་རེག་པ་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། མིག་གི་འདུས་ཏེ་རེག་པ་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that visually compounded sensory contact is impermanent, and they teach that visually compounded sensory contact is imbued with suffering, without self, and unpleasant.

source: རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་ལྕེའི་འདུས་ཏེ་རེག་པ་དང་ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་སྣའི་འདུས་ཏེ་རེག་པ་དང་ལྕེའི་འདུས་ཏེ་རེག་པ་དང་ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་། མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are impermanent, and they teach that aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are imbued with suffering, without self, and unpleasant. “

source: མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་། མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན། རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་།
en: They teach that feelings conditioned by visually compounded sensory contact are impermanent, and they teach that feelings conditioned by visually compounded sensory contact are imbued with suffering, without self, and unpleasant.

source: ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་ཀྱིས་ཚོར་བ་དང་།
en: They teach that feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, and feelings conditioned by mentally compounded sensory contact are impermanent, and they teach that feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, and feelings conditioned by mentally compounded sensory contact are imbued with suffering, without self, and unpleasant. “

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་། བདག་མེད་དོ་ཞེས་བྱ་བ་དང་། མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན། སའི་ཁམས་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། སའི་ཁམས་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that the earth element is impermanent, and they teach that the earth element is imbued with suffering, without self, and unpleasant.

source: ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་།
en: They teach that the water element, the fire element, the wind element, {Ki.

source: རྣམ་པར་ཤེས་པའི་ཁམས་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་།
en: II-II: 111} the space element, and the consciousness element are impermanent, and they teach that the water element, the fire element, the wind element, the space element, and the consciousness element are imbued with suffering, without self, and unpleasant. “

source: རྣམ་པར་ཤེས་པའི་ཁམས་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་། བདག་མེད་དོ་ཞེས་བྱ་བ་དང་། མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན། མ་རིག་པ་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། མ་རིག་པ་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་།
en: They teach that the ignorance is impermanent, and they teach that ignorance is imbued with suffering, without self, and unpleasant.

source: བདག་མེད་དོ་ཞེས་བྱ་བ་དང་། མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན། འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་ལེན་པ་དང་སྲིད་པ་དང་སྐྱེ་བ་དང་རྒ་ཤི་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་ལེན་པ་དང་སྲིད་པ་དང་། སྐྱེ་བ་དང་རྒ་ཤི་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death are impermanent, and they teach that formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death are imbued with suffering, without self, and unpleasant. “

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: They teach that the perfection of generosity is impermanent, and they teach that the perfection of generosity is imbued with suffering, without self, and unpleasant.

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་དུ་ཕྱིན་པ་དང་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་། བདག་མེད་དོ་ཞེས་བྱ་བ་དང་། མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are impermanent, and they teach that the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are imbued with suffering, without self, and unpleasant. “

source: ནང་སྟོང་པ་ཉིད་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། ནང་སྟོང་པ་ཉིད་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་། བདག་མེད་དོ་ཞེས་བྱ་བ་དང་། མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that the emptiness of internal phenomena is impermanent, and they teach that the emptiness of internal phenomena is imbued with suffering, without self, and unpleasant.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་། བདག་མེད་དོ་ཞེས་བྱ་བ་དང་། མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are impermanent, and they teach that the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are imbued with suffering, without self, and unpleasant. “

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that the applications of mindfulness are impermanent, and they teach that the applications of mindfulness are imbued with suffering, without self, and unpleasant.

source: ཡང་དག་པར་སྤོང་བ་དང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་དབང་པོ་དང་སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། ཡང་དག་པར་སྤོང་བ་དང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་དབང་པོ་དང་སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་། བདག་མེད་དོ་ཞེས་བྱ་བ་དང་མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are impermanent, and they teach that the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are imbued with suffering, without self, and unpleasant. “

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་དུ་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་བདག་མེད་དོ་ཞེས་བྱ་བ་དང་མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན།
en: They teach that [the fruitional attributes], up to and including the distinct qualities of the buddhas, are impermanent, and they teach that [the fruitional attributes], up to and including the distinct qualities of the buddhas, are imbued with suffering, without self, and unpleasant. “

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མི་རྟག་གོ་ཞེས་བྱ་བར་སྟོན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་། བདག་མེད་དོ་ཞེས་བྱ་བ་དང་མི་སྡུག་གོ་ཞེས་བྱ་བར་སྟོན་ཅིང་།
en: They teach that [the fruits], up to and including all-aspect omniscience, are impermanent, and they teach that [the fruits], up to and including all-aspect omniscience, are imbued with suffering, without self, and unpleasant. “

source: འདི་སྐད་དུ་གང་དེ་ལྟར་སྟོན་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ་ཞེས་བརྗོད་དེ། སུ་ལ་བསྟན་པ་དེ་དག་ཀྱང་གཟུགས་མི་རྟག་ཅེས་བྱ་བར་རྟོག་པར་འགྱུར་རོ། །གཟུགས་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་། བདག་མེད་ཅེས་བྱ་བ་དང་། མི་སྡུག་ཅེས་བྱ་བར་རྣམ་པར་རྟོག་པར་འགྱུར་རོ།
en: They say that those who teach accordingly practice the perfection of wisdom, and those whom they teach will also think that physical forms are impermanent, and that physical forms are imbued with suffering, without self, and unpleasant.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མི་རྟག་ཅེས་བྱ་བར་རྟོག་པར་འགྱུར་རོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བ་དང་། བདག་མེད་ཅེས་བྱ་བ་དང་། མི་སྡུག་ཅེས་བྱ་བར་རྟོག་པར་འགྱུར་རོ།
en: They will think that [all phenomena, attributes, and fruits], up to and including all-aspect omniscience, are impermanent, and they will think that [all phenomena, attributes, and fruits, up to and including] all-aspect omniscience, are imbued with suffering, without self, and unpleasant.

source: །དེ་ལྟར་དེ་དག་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མི་རྟག་གོ་ཞེས་བྱ་བར་རྟོག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་སྡུག་བསྔལ་ལོ་ཞེས་བྱ་བར་རྟོག་པ་དང་། བདག་མེད་དོ་ཞེས་བྱ་བར་རྟོག་པ་དང་། མི་སྡུག་གོ་ཞེས་བྱ་བར་རྟོག་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གཟུགས་བརྙན་ལ་སྤྱོད་པར་འགྱུར་ཏེ།
en: They will practice an imitation of the perfection of wisdom because they will think that all-aspect omniscience [and so forth] are impermanent, and because they will think that all-aspect omniscience [and so forth] are imbued with suffering, without self, and unpleasant.

source: ཀཽ་ཤི་ཀ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་གཟུགས་བརྙན་ནོ།
en: That, Kauśika, is an imitation of the perfection of wisdom. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོན་ན་འདི་ལྟར་སྟོན་ཏེ།
en: Moreover, Kauśika, when those noble sons or noble daughters reveal the perfection of wisdom, they will teach as follows: ‘Come here, noble child!

source: ཚུར་རིགས་ཀྱི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒོམས་ཤིག །
en: You should cultivate the perfection of wisdom!

source: ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་ལ་གནས་པར་འགྱུར་རོ། །ས་བཅུ་པའི་བར་ལ་གནས་པར་འགྱུར་རོ།
en: After cultivating the perfection of wisdom, you will dwell on the first bodhisattva level, and you will dwell on [the other bodhisattva] levels, up to and including the tenth.

source: །ཚུར་རིགས་ཀྱི་བུ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒོམས་ཤིག །
en: Come here, noble child! You should cultivate the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity.

source: ཁྱོད་ཀྱིས་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་ལ་གནས་པར་འགྱུར་རོ། །ས་བཅུ་པའི་བར་ལ་གནས་པར་འགྱུར་རོ་ཞེས།
en: After cultivating the perfection of generosity [and so forth], you will dwell on the first bodhisattva level, and you will dwell on [the other bodhisattva] levels, up to and including the tenth.’ “

source: དེ་ཡང་མཚན་མའི་ཚུལ་དང་། དམིགས་པའི་ཚུལ་གྱིས་སྟོན་ཏེ།
en: However, they will teach by means of signs and by way of apprehending.

source: དེ་དུས་ཀྱི་འདུ་ཤེས་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒོམ་པར་འགྱུར་ཏེ།
en: They will cultivate the perfection of wisdom through that temporal perception.

source: ཀཽ་ཤི་ཀ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཟུགས་བརྙན་ནོ།
en: That, Kauśika, is an imitation of the perfection of wisdom. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དག་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལྟར་སྟོན་ཏེ།
en: Moreover, Kauśika, those noble sons or noble daughters will teach this perfection of wisdom as follows to noble sons or noble daughters who adhere to the vehicle of the bodhisattvas: ‘Come here, noble child!

source: ཚུར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམས་ཤིག །
en: You should cultivate the perfection of wisdom!

source: རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྒོམས་ན། ཉན་ཐོས་ཀྱི་ས་ལས་འདའ་བར་འགྱུར་རོ། །རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདའ་བར་འགྱུར་རོ་ཞེས་སྟོན་ཏེ།
en: If, noble child, you cultivate the perfection of wisdom, you will go beyond the level of the śrāvakas and you will go beyond the level of the pratyekabuddhas!’

source: ཀཽ་ཤི་ཀ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གཟུགས་བརྙན་ནོ།
en: That, Kauśika, is an imitation of the perfection of wisdom. {Ki.

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོན་པ་ན་འདི་ལྟར་སྟོན་ཏེ། ཚུར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒོམས་ཤིག །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྒོམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་པར་འགྱུར་རོ།
en: II-III: 113} “Moreover, Kauśika, if those noble sons or noble daughters reveal the perfection of wisdom to noble sons or noble daughters who adhere to the vehicle of the bodhisattvas, they will teach as follows: ‘Come here, noble child!

source: །མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་འགྱུར་རོ།
en: You should cultivate the perfection of wisdom!

source: །ཁྱོད་ཀྱིས་དེ་ལྟར་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་ལ་གནས་ཏེ།
en: You will enter a bodhisattva’s full maturity, you will accept that phenomena are nonarising, and you will maintain the extrasensory powers of the bodhisattvas!

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ། རིམ་གྲོ་དང་བཀུར་སྟི་དང་སྟི་སྟང་དང་མཆོད་པར་བྱེད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ནས། སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བར་འགྱུར་རོ་ཞེས།
en: You will serve, respect, honor, and worship the tathāgatas, arhats, completely awakened buddhas, and you will travel from buddhafield to buddhafield!’ “

source: རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་དག །བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ་སྟོན་ན་འདི་སྐད་སྟོན་ཏེ། རིགས་ཀྱི་བུ་དག་སུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འཛིན་པ་དང་། འཆང་བ་དང་ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཚད་མེད་གྲངས་མེད་དཔག་ཏུ་མེད་པར་འགྱུར་རོ་ཞེས་ཟེར་ཏེ།
en: If those noble sons or noble daughters teach noble sons or noble daughters who adhere to the vehicle of the bodhisattvas, they will teach as follows: they will say, ‘Those noble children who take up, uphold, recite, master, and focus their attention correctly on the profound perfection of wisdom will acquire an immeasurable, incalculable, inestimable mass of merit!’

source: དེ་ལྟར་སྟོན་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཟུགས་བརྙན་སྟོན་ཏོ།
en: But those noble sons or noble daughters who teach in that manner will actually teach an imitation of the perfection of wisdom. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ་འདི་ལྟར་སྟོན་ཏོ། །ཚུར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་འདས་པ་དང་།
en: Moreover, Kauśika, those noble sons or noble daughters will teach noble sons or noble daughters who adhere to the vehicle of the bodhisattvas as follows: ‘Come here, noble child!

source: མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཐུགས་དང་པོ་བསྐྱེད་པ་ནས་ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བར་གྱི། དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་བསྡུས་ཏེ།
en: You should gather together all the roots of virtuous action, as many as there are, of the tathāgatas, arhats, completely awakened buddhas of the past, future, and present, from the time when they first begin to set their mind on enlightenment until their attainment of final nirvāṇa, in the expanse of nirvāṇa where no aggregates are left behind!

source: རྗེས་སུ་དགའ་བར་གྱིས་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ཤིག་ཅེས།
en: You should rejoice in them and dedicate them to unsurpassed, complete enlightenment!’

source: རིགས་ཀྱི་བུ་ལས་རིགས་ཀྱི་བུ་མོ་དེ་དག་དེ་ལྟར་སྟོན་ཅིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཟུགས་བརྙན་སྟོན་ཏོ།
en: Teaching in that manner, those noble sons or noble daughters will actually teach an imitation of the perfection of wisdom.”

source: །བརྒྱ་བྱིན་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་སྟོན་པའི་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཟུགས་བརྙན་མི་སྟོན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Śakra then asked, “Blessed Lord, how do those noble sons or noble daughters teach, so as not to teach an imitation of the perfection of wisdom to noble sons or noble daughters who adhere to the vehicle of the bodhisattvas?” {

source: ཀཽ་ཤི་ཀ་འདི་ལ་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དག་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལྟར་སྟོན་ཏེ།
en: Ki.II-III: 114} “In this regard, Kauśika,” replied the Blessed One, “those noble sons or noble daughters should teach the perfection of wisdom to noble sons or noble daughters who follow the vehicle of the bodhisattvas in the following manner: ‘Come here, noble child!

source: ཚུར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒོམས་ཤིག །
en: You should cultivate the perfection of wisdom!

source: གཟུགས་མི་རྟག་ཅེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མ་ལྟ་ཤིག །
en: Do not consider that physical forms are impermanent.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། གཟུགས་ནི་རང་བཞིན་གྱིས་སྟོང་སྟེ།
en: If you ask why, physical forms are empty of inherent existence.

source: གཟུགས་ཀྱི་རང་བཞིན་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་མེད་པའོ།
en: Whatever is the nature of physical forms is nonentity.

source: །དངོས་པོ་མེད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟེ།
en: Whatever is a nonentity is the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ལ་ནི་གཟུགས་རྟག་ཅེས་བྱའམ། གཟུགས་མི་རྟག་ཅེས་བྱ་བ་མི་དམིགས་སོ།
en: Whatever is the perfection of wisdom does not apprehend that physical forms are permanent, or that physical forms are impermanent.

source: །དེ་ལ་གཟུགས་ཉིད་ཀྱང་མེད་ན་རྟག་པའམ་མི་རྟག་པ་ལྟ་ག་ལ་ཡོད་ཅེས་སྟོན་ཏེ།
en: If physical forms themselves are nonexistent, how could they be permanent or impermanent!’

source: ཀཽ་ཤི་ཀ་དེ་ལྟར་སྟོན་པའི་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཟུགས་བརྙན་མི་སྟོན་ཏོ།
en: Kauśika, those noble sons or noble daughters who teach in that manner do not teach an imitation of the perfection of wisdom. “

source: ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལྟར་སྟོན་ཏེ།
en: Moreover, Kauśika, those noble sons or noble daughters should teach the perfection of wisdom to noble sons or noble daughters who adhere to the vehicle of the bodhisattvas in the following manner: ‘Come here, noble child!

source: ཚོར་བ་མི་རྟག་ཅེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མ་ལྟ་ཤིག །
en: Do not consider that feelings are impermanent.

source: འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མི་རྟག་ཅེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མ་ལྟ་ཤིག །
en: Do not consider that perceptions, formative predispositions, and consciousness are impermanent.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རྣམ་པར་ཤེས་པ་ནི་རང་བཞིན་གྱིས་སྟོང་སྟེ།
en: If you ask why, consciousness [and those other aggregates] are empty of inherent existence.

source: རྣམ་པར་ཤེས་པའི་རང་བཞིན་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་མེད་པའོ།
en: Whatever is the nature of consciousness [and so forth] is nonentity.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ལ་ནི། རྣམ་པར་ཤེས་པ་རྟག་ཅེས་བྱ་བ་འམ། མི་རྟག་ཅེས་བྱ་བ་མི་དམིགས་སོ།
en: Whatever is the perfection of wisdom does not apprehend that consciousness [and so forth] are permanent or impermanent.

source: །དེ་ལ་རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་མེད་ན། རྟག་པའམ་མི་རྟག་པ་ལྟ་ག་ལ་ཡོད་ཅེས་སྟོན་ཏེ།
en: If consciousness [and so forth] are themselves nonexistent, how could they be permanent or impermanent!’

source: ཀཽ་ཤི་ཀ་དེ་ལྟར་སྟོན་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཟུགས་བརྙན་མི་སྟོན་ཏོ།
en: Kauśika, those noble sons or noble daughters who teach in that manner do not teach an imitation of the perfection of wisdom. “

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལྟར་སྟོན་ཏེ། ཚུར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒོམས་ཤིག །
en: Moreover, Kauśika, those noble sons or noble daughters should teach the perfection of wisdom to noble sons or noble daughters who adhere to the vehicle of the bodhisattvas in the following manner: ‘Come here, noble child!

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མི་རྟག་ཅེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མ་ལྟ་ཤིག །
en: You should cultivate the perfection of wisdom! Do not consider that [phenomena, attributes, or fruits], up to and including all-aspect omniscience, are impermanent.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་རང་བཞིན་གྱིས་སྟོང་སྟེ།
en: If you ask why, all-aspect omniscience [and so forth] are empty of inherent existence.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རང་བཞིན་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་མེད་པའོ།
en: Whatever is the nature of all-aspect omniscience [and so forth] is nonentity.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ལ་ནི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྟག་ཅེས་བྱ་བ་འམ། མི་རྟག་ཅེས་བྱ་བ་མི་དམིགས་སོ།
en: Whatever is the perfection of wisdom does not apprehend that all-aspect omniscience [and so forth] are permanent or impermanent.

source: །དེ་ལ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་མེད་ན། རྟག་པ་འམ་མི་རྟག་པ་ལྟ་ག་ལ་ཡོད་ཅེས་སྟོན་ཏེ།
en: If all-aspect omniscience [and so forth] are themselves nonexistent, how could they be permanent or impermanent!’

source: །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལྟར་སྟོན་ཏེ།
en: Moreover, Kauśika, those noble sons or noble daughters should teach the perfection of wisdom to noble sons or noble daughters who adhere to the vehicle of the bodhisattvas in the following manner: {Ki.

source: ཆོས་གང་ལས་ཀྱང་ཡོངས་སུ་འདའ་བར་མ་བྱེད་ཅིག །
en: Do not go beyond anything at all!

source: ཆོས་གང་ལ་ཡང་གནས་གནས་པར་མ་བྱེད་ཅིག །
en: Do not dwell in anything at all!’
